<?php
$cities = "Айтос
Аксаково
Алфатар
Антоново
Априлци
Ардино
Асеновград
Ахтопол
Балчик
Банкя
Банско
Баня
Батак
Батановци
Белене
Белица
Белово
Белоградчик
Белослав
Берковица
Благоевград
Бобовдол
Бобошево
Божурище
Бойчиновци
Болярово
Борово
Ботевград
Брацигово
Брегово
Брезник
Брезово
Брусарци
Бургас
Бухово
Българово
Бяла (Област Варна)
Бяла (Област Русе)
Бяла Слатина
Бяла черква
Варна
Велики Преслав
Велико Търново
Велинград
Ветово
Видин
Враца
Вълчедръм
Вълчидол
Върбица
Вършец
Габрово
Генерал Тошево
Главиница
Глоджево
Годеч
Горна Оряховица
Гоце Делчев
Грамада
Гулянци
Гурково
Гълъбово
Две могили
Дебелец
Девин
Девня
Джебел
Димитровград
Димово
Добрич
Долни Чифлик
Долна Баня
Долна Митрополия
Долна Оряховица
Долни Дъбник
Доспат
Драгоман
Дряново
Дулово
Дунавци
Дупница
Дългопол
Елена
Елин Пелин
Елхово
Етрополе
Завет
Земен
Златарица
Златица
Златоград
Ивайловград
Искър
Исперих
Ихтиман
Каблешково
Каварна
Казанлък
Калофер
Камено
Каолиново
Карлово
Карнобат
Каспичан
Кермен
Килифарево
Китен
Клисура
Кнежа
Козлодуй
Койнаре
Копривщица
Костенец
Костинброд
Котел
Кочериново
Криводол
Кричим
Крумовград
Кубрат
Куклен
Кула
Кърджали
Кюстендил
Левски
Летница
Ловеч
Лозница
Лом
Луковит
Лъки
Любимец
Лясковец
Мадан
Маджарово
Малко Търново
Марица
Мартен
Мездра
Мелник
Меричлери
Мизия
Момчилград
Монтана
Мъглиж
Неделино
Несебър
Николаево
Никопол
Нова Загора
Нови Искър
Нови пазар
Обзор
Омуртаг
Опака
Оряхово
Павел баня
Павликени
Пазарджик
Панагюрище
Перник
Перущица
Петрич
Пещера
Пирдоп
Плачковци
Плевен
Плиска
Пловдив
Полски Тръмбеш
Поморие
Попово
Пордим
Правец
Приморско
Провадия
Първомай
Раднево
Радомир
Разград
Разлог
Ракитово
Раковски
Рила
Роман
Рудозем
Русе
Садово
Самоков
Сандански
Сапарева баня
Свети Влас
Свиленград
Свищов
Своге
Севлиево
Сеново
Септември
Силистра
Симеоновград
Симитли
Славяново
Сливен
Сливница
Сливо поле
Смолян
Смядово
Созопол
Сопот
София
Средец
Средногорие
Стамболийски
Стара Загора
Стражица
Стралджа
Стрелча
Суворово
Сунгурларе
Сухиндол
Съединение
Сърница
Твърдица
Тервел
Тетевен
Тополовград
Троян
Трън
Тръстеник
Трявна
Тутракан
Търговище
Угърчин
Хаджидимово
Харманли
Хасково
Хисаря
Царево
Цар Калоян
Чепеларе
Червен бряг
Чипровци
Чирпан
Шабла
Шивачево
Шипка
Шумен
Ябланица
Якоруда
Ямбол";

$cities = explode( "\n", $cities);
foreach($cities as $city){
	$new[] = trim($city);
}

$cities = $new;